src/Documents/ПередачаВозвратовОрганизаторам/ПередачаВозвратовОрганизаторам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаВозвратовОрганизаторам</name>
  <registerRecords>AccumulationRegister.Возвраты</registerRecords>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Посылки</types>
      </type>
    </attributes>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.Организаторы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/Возвраты/Возвраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Возвраты</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Участники</types>
      <types>CatalogRef.Организаторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.Посылки</types>
      <types>CatalogRef.Коробки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ВозвратГруппОрганизатору</types>
      <types>DocumentRef.ВозвратПокупокОрганизатору</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.ДвижениеТранзита</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ПередачаВозвратовОрганизаторам/Forms/ФормаДокумента/Module.bsl
Процедура ЗаполнитьВозвраты() 
	Если Объект.Проведен Тогда
		Сообщить("Нельзя заполнить проведенный документ!!!");	
	Иначе	
		Объект.Покупки.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратыОстатки.Организатор,
		|	ВозвратыОстатки.Участник,
		|	ВозвратыОстатки.Покупка,
		|	ВозвратыОстатки.КоличествоОстаток КАК количество
		|ИЗ
		|	РегистрНакопления.Возвраты.Остатки(, ) КАК ВозвратыОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВозвратыОстатки.Организатор.Наименование";
		
		Результат = Запрос.Выполнить();
		Объект.Покупки.Загрузить(Результат.Выгрузить());
	КонецЕсли;
КонецПроцедуры 


&НаКлиенте
Процедура Заполнить(Команда)
	
		ЗаполнитьВозвраты();

КонецПроцедуры
